In [1]:
import pyspark

In [2]:
import pandas as pd

In [4]:
print("hello pysprak")

hello pysprak

In [6]:
pd.read_csv('testexcel.csv')

       Name  Age
0   Krishna  450
1  Sudanshu   30
2      Mike   33
3    Vedant  100

#PYSPARK SESSION BEGINS

In [7]:
from pyspark.sql import SparkSession

In [10]:
spark=SparkSession.builder.appName('Practice').getOrCreate()

In [11]:
spark

In [13]:
spark.read.csv('testexcel.csv').show()

+--------+---+
|     _c0|_c1|
+--------+---+
|    Name|Age|
| Krishna|450|
|Sudanshu| 30|
|    Mike| 33|
|  Vedant|100|
+--------+---+

In [14]:
variable_data=spark.read.option('header','true').csv('testexcel.csv')

In [17]:
type(variable_data)

pyspark.sql.dataframe.DataFrame

In [16]:
variable_data.show()

+--------+---+
|    Name|Age|
+--------+---+
| Krishna|450|
|Sudanshu| 30|
|    Mike| 33|
|  Vedant|100|
+--------+---+

In [18]:
variable_data.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: string (nullable = true)

#**DataFrame Session started**

In [22]:
#DataFrame Session started 
read_data=SparkSession.builder.appName('DataFrame').getOrCreate()

In [21]:
#by default data is read as "strings"
read_data.read.option('header','true').csv('DataFrames.csv')

DataFrame[Name: string, Age: string, Experience: string]

In [63]:
#to infer datatype as it is we use ",inferSchema=True"
dataframe_var=read_data.read.option('header','true').csv('DataFrames.csv',inferSchema=True)

In [57]:
dataframe_var.columns

['Name', 'Age', 'Experience']

In [58]:
type(dataframe_var.head(5))

list

In [59]:
dataframe_var.head(5)

[Row(Name='Krishna', Age=450, Experience=10),
 Row(Name='Sudanshu', Age=30, Experience=8),
 Row(Name='Mike', Age=33, Experience=4),
 Row(Name='Vedant', Age=100, Experience=2)]

#Adding columns in data frame

In [64]:
dataframe_var=dataframe_var.withColumn('Experience_after_2yrs',dataframe_var['Experience']+2)

In [65]:
dataframe_var.show()

+--------+---+----------+---------------------+
|    Name|Age|Experience|Experience_after_2yrs|
+--------+---+----------+---------------------+
| Krishna|450|        10|                   12|
|Sudanshu| 30|         8|                   10|
|    Mike| 33|         4|                    6|
|  Vedant|100|         2|                    4|
+--------+---+----------+---------------------+

#Dropping a column in pyspark

In [66]:
dataframe_var=dataframe_var.drop('Experience_after_2yrs')

In [67]:
dataframe_var.show()

+--------+---+----------+
|    Name|Age|Experience|
+--------+---+----------+
| Krishna|450|        10|
|Sudanshu| 30|         8|
|    Mike| 33|         4|
|  Vedant|100|         2|
+--------+---+----------+

#Handling Missing Values

In [69]:
from pyspark.sql import SparkSession

In [70]:
spark=SparkSession.builder.appName('Practice').getOrCreate()

In [72]:
view_csv_data=spark.read.csv('HandlingMissingVals.csv',header=True,inferSchema=True)

In [82]:
view_csv_data.show()

+--------+----+----------+------+
|    Name| Age|Experience|Salary|
+--------+----+----------+------+
| Krishna| 450|        10| 30000|
|Sudanshu|  30|         8| 25000|
|    Mike|  33|         4| 20000|
|  Vedant| 100|         2| 20000|
| shubham|  22|         2| 90000|
|  mahesh|null|      null| 40000|
|    null|  34|        10| 20000|
|    null|  28|      null|  null|
+--------+----+----------+------+

#to drop all the rows having any number of null values

In [ ]:
#view_csv_data.na.drop().show()

In [75]:
#drop(how= "any") which is default, 
#thresh means atleast 2 non null values should be present
view_csv_data.na.drop(how='any',thresh=2).show()

+--------+----+----------+------+
|    Name| Age|Experience|Salary|
+--------+----+----------+------+
| Krishna| 450|        10| 30000|
|Sudanshu|  30|         8| 25000|
|    Mike|  33|         4| 20000|
|  Vedant| 100|         2| 20000|
| shubham|  22|         2| 90000|
|  mahesh|null|      null| 40000|
|    null|  34|        10| 20000|
+--------+----+----------+------+

In [78]:
# if ther is any row having Experience column as null it will
# be droped
view_csv_data.na.drop(how='any',subset=['Experience']).show()

+--------+---+----------+------+
|    Name|Age|Experience|Salary|
+--------+---+----------+------+
| Krishna|450|        10| 30000|
|Sudanshu| 30|         8| 25000|
|    Mike| 33|         4| 20000|
|  Vedant|100|         2| 20000|
| shubham| 22|         2| 90000|
|    null| 34|        10| 20000|
+--------+---+----------+------+

#Filling the Missing values

In [85]:
view_csv_data.show()

+--------+----+----------+------+
|    Name| Age|Experience|Salary|
+--------+----+----------+------+
| Krishna| 450|        10| 30000|
|Sudanshu|  30|         8| 25000|
|    Mike|  33|         4| 20000|
|  Vedant| 100|         2| 20000|
| shubham|  22|         2| 90000|
|  mahesh|null|      null| 40000|
|    null|  34|        10| 20000|
|    null|  28|      null|  null|
+--------+----+----------+------+

In [94]:
#NOTE: the data type of the replace value should be same as that of column datatype
view_csv_data.na.fill(value=0,subset=['Experience']).show()

+--------+----+----------+------+
|    Name| Age|Experience|Salary|
+--------+----+----------+------+
| Krishna| 450|        10| 30000|
|Sudanshu|  30|         8| 25000|
|    Mike|  33|         4| 20000|
|  Vedant| 100|         2| 20000|
| shubham|  22|         2| 90000|
|  mahesh|null|         0| 40000|
|    null|  34|        10| 20000|
|    null|  28|         0|  null|
+--------+----+----------+------+

In [97]:
view_csv_data.na.fill(value=0,subset=['Age']).show()

+--------+---+----------+------+
|    Name|Age|Experience|Salary|
+--------+---+----------+------+
| Krishna|450|        10| 30000|
|Sudanshu| 30|         8| 25000|
|    Mike| 33|         4| 20000|
|  Vedant|100|         2| 20000|
| shubham| 22|         2| 90000|
|  mahesh|  0|      null| 40000|
|    null| 34|        10| 20000|
|    null| 28|      null|  null|
+--------+---+----------+------+

In [98]:
view_csv_data.na.fill(value='MissingValue',subset='Name').show()

+------------+----+----------+------+
|        Name| Age|Experience|Salary|
+------------+----+----------+------+
|     Krishna| 450|        10| 30000|
|    Sudanshu|  30|         8| 25000|
|        Mike|  33|         4| 20000|
|      Vedant| 100|         2| 20000|
|     shubham|  22|         2| 90000|
|      mahesh|null|      null| 40000|
|MissingValue|  34|        10| 20000|
|MissingValue|  28|      null|  null|
+------------+----+----------+------+